In [ ]:
from google.colab import drive
drive.mount('/content/drive')

In [1]:
import numpy as np

In [2]:
a=np.array([1,2,3,4,5])

In [3]:
type(a)

numpy.ndarray

In [4]:
import os

In [5]:
os.getcwd()

'/content'

In [6]:
import pandas as pd

In [7]:
df=pd.read_csv("/content/drive/MyDrive/Colab Notebooks/titanic.csv")

In [8]:
df.shape

(891, 12)

In [9]:
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [10]:
type(df)

pandas.core.frame.DataFrame

In [11]:
type(df["Age"])

pandas.core.series.Series

In [12]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [13]:
sum(df["Cabin"].isnull())

687

In [14]:
df.drop(["Cabin"],axis=1,inplace=True)

In [15]:
df["Ticket"][0:5]

0           A/5 21171
1            PC 17599
2    STON/O2. 3101282
3              113803
4              373450
Name: Ticket, dtype: object

In [16]:
df.drop(["Ticket"],axis=1,inplace=True)

In [17]:
df.apply(lambda x:sum(x.isnull()),axis=0)

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Fare             0
Embarked         2
dtype: int64

In [18]:
df.Age.fillna(df.Age.mean(),inplace=True)
df.apply(lambda x:sum(x.isnull()),axis=0)

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Fare           0
Embarked       2
dtype: int64

In [19]:
def get_title(name):
    if '.' in name:
        return name.split(',')[1].split('.')[0].strip()
    else:
        return 'Unknown'

ans=get_title('Braund, Mr. Owen Harris')
print (ans)

Mr

In [20]:
df2 = [df.Name.str.split(' ')[index][0]
             for index in range(0, len(df))]
print(df2)

['Braund,', 'Cumings,', 'Heikkinen,', 'Futrelle,', 'Allen,', 'Moran,', 'McCarthy,', 'Palsson,', 'Johnson,', 'Nasser,', 'Sandstrom,', 'Bonnell,', 'Saundercock,', 'Andersson,', 'Vestrom,', 'Hewlett,', 'Rice,', 'Williams,', 'Vander', 'Masselmani,', 'Fynney,', 'Beesley,', 'McGowan,', 'Sloper,', 'Palsson,', 'Asplund,', 'Emir,', 'Fortune,', "O'Dwyer,", 'Todoroff,', 'Uruchurtu,', 'Spencer,', 'Glynn,', 'Wheadon,', 'Meyer,', 'Holverson,', 'Mamee,', 'Cann,', 'Vander', 'Nicola-Yarred,', 'Ahlin,', 'Turpin,', 'Kraeff,', 'Laroche,', 'Devaney,', 'Rogers,', 'Lennon,', "O'Driscoll,", 'Samaan,', 'Arnold-Franchi,', 'Panula,', 'Nosworthy,', 'Harper,', 'Faunthorpe,', 'Ostby,', 'Woolner,', 'Rugg,', 'Novel,', 'West,', 'Goodwin,', 'Sirayanian,', 'Icard,', 'Harris,', 'Skoog,', 'Stewart,', 'Moubarek,', 'Nye,', 'Crease,', 'Andersson,', 'Kink,', 'Jenkin,', 'Goodwin,', 'Hood,', 'Chronopoulos,', 'Bing,', 'Moen,', 'Staneff,', 'Moutal,', 'Caldwell,', 'Dowdell,', 'Waelens,', 'Sheerlinck,', 'McDermott,', 'Carrau,', 'Ilett,', 'Backstrom,', 'Ford,', 'Slocovski,', 'Fortune,', 'Celotti,', 'Christmann,', 'Andreasson,', 'Chaffee,', 'Dean,', 'Coxon,', 'Shorney,', 'Goldschmidt,', 'Greenfield,', 'Doling,', 'Kantor,', 'Petranec,', 'Petroff,', 'White,', 'Johansson,', 'Gustafsson,', 'Mionoff,', 'Salkjelsvik,', 'Moss,', 'Rekic,', 'Moran,', 'Porter,', 'Zabour,', 'Barton,', 'Jussila,', 'Attalah,', 'Pekoniemi,', 'Connors,', 'Turpin,', 'Baxter,', 'Andersson,', 'Hickman,', 'Moore,', 'Nasser,', 'Webber,', 'White,', 'Nicola-Yarred,', 'McMahon,', 'Madsen,', 'Peter,', 'Ekstrom,', 'Drazenoic,', 'Coelho,', 'Robins,', 'Weisz,', 'Sobey,', 'Richard,', 'Newsom,', 'Futrelle,', 'Osen,', 'Giglio,', 'Boulos,', 'Nysten,', 'Hakkarainen,', 'Burke,', 'Andrew,', 'Nicholls,', 'Andersson,', 'Ford,', 'Navratil,', 'Byles,', 'Bateman,', 'Pears,', 'Meo,', 'van', 'Olsen,', 'Williams,', 'Gilnagh,', 'Corn,', 'Smiljanic,', 'Sage,', 'Cribb,', 'Watt,', 'Bengtsson,', 'Calic,', 'Panula,', 'Goldsmith,', 'Chibnall,', 'Skoog,', 'Baumann,', 'Ling,', 'Van', 'Rice,', 'Johnson,', 'Sivola,', 'Smith,', 'Klasen,', 'Lefebre,', 'Isham,', 'Hale,', 'Leonard,', 'Sage,', 'Pernot,', 'Asplund,', 'Becker,', 'Kink-Heilmann,', 'Rood,', "O'Brien,", 'Romaine,', 'Bourke,', 'Turcin,', 'Pinsky,', 'Carbines,', 'Andersen-Jensen,', 'Navratil,', 'Brown,', 'Lurette,', 'Mernagh,', 'Olsen,', 'Madigan,', 'Yrois,', 'Vande', 'Sage,', 'Johanson,', 'Youseff,', 'Cohen,', 'Strom,', 'Backstrom,', 'Albimona,', 'Carr,', 'Blank,', 'Ali,', 'Cameron,', 'Perkin,', 'Givard,', 'Kiernan,', 'Newell,', 'Honkanen,', 'Jacobsohn,', 'Bazzani,', 'Harris,', 'Sunderland,', 'Bracken,', 'Green,', 'Nenkoff,', 'Hoyt,', 'Berglund,', 'Mellors,', 'Lovell,', 'Fahlstrom,', 'Lefebre,', 'Harris,', 'Larsson,', 'Sjostedt,', 'Asplund,', 'Leyson,', 'Harknett,', 'Hold,', 'Collyer,', 'Pengelly,', 'Hunt,', 'Zabour,', 'Murphy,', 'Coleridge,', 'Maenpaa,', 'Attalah,', 'Minahan,', 'Lindahl,', 'Hamalainen,', 'Beckwith,', 'Carter,', 'Reed,', 'Strom,', 'Stead,', 'Lobb,', 'Rosblom,', 'Touma,', 'Thorne,', 'Cherry,', 'Ward,', 'Parrish,', 'Smith,', 'Asplund,', 'Taussig,', 'Harrison,', 'Henry,', 'Reeves,', 'Panula,', 'Persson,', 'Graham,', 'Bissette,', 'Cairns,', 'Tornquist,', 'Mellinger,', 'Natsch,', 'Healy,', 'Andrews,', 'Lindblom,', 'Parkes,', 'Rice,', 'Abbott,', 'Duane,', 'Olsson,', 'de', 'Dorking,', 'Smith,', 'Stankovic,', 'de', 'Naidenoff,', 'Hosono,', 'Connolly,', 'Barber,', 'Bishop,', 'Levy,', 'Haas,', 'Mineff,', 'Lewy,', 'Hanna,', 'Allison,', 'Saalfeld,', 'Baxter,', 'Kelly,', 'McCoy,', 'Johnson,', 'Keane,', 'Williams,', 'Allison,', 'Fleming,', 'Penasco', 'Abelson,', 'Francatelli,', 'Hays,', 'Ryerson,', 'Lahtinen,', 'Hendekovic,', 'Hart,', 'Nilsson,', 'Kantor,', 'Moraweck,', 'Wick,', 'Spedden,', 'Dennis,', 'Danoff,', 'Slayter,', 'Caldwell,', 'Sage,', 'Young,', 'Nysveen,', 'Ball,', 'Goldsmith,', 'Hippach,', 'McCoy,', 'Partner,', 'Graham,', 'Vander', 'Frauenthal,', 'Denkoff,', 'Pears,', 'Burns,', 'Dahl,', 'Blackwell,', 'Navratil,', 'Fortune,', 'Collander,', 'Sedgwick,', 'Fox,', 'Brown,', 'Smith,', 'Davison,', 'Coutts,', 'Dimic,', 'Odahl,', 'Williams-Lambert,', 'Elias,', 'Arnold-Franchi,', 'Yousif,', 'Vanden', 'Bowerman,', 'Funk,', 'McGovern,', 'Mockler,', 'Skoog,', 'del', 'Barbara,', 'Asim,', "O'Brien,", 'Adahl,', 'Warren,', 'Moussa,', 'Jermyn,', 'Aubart,', 'Harder,', 'Wiklund,', 'Beavan,', 'Ringhini,', 'Palsson,', 'Meyer,', 'Landergren,', 'Widener,', 'Betros,', 'Gustafsson,', 'Bidois,', 'Nakid,', 'Tikkanen,', 'Holverson,', 'Plotcharsky,', 'Davies,', 'Goodwin,', 'Buss,', 'Sadlier,', 'Lehmann,', 'Carter,', 'Jansson,', 'Gustafsson,', 'Newell,', 'Sandstrom,', 'Johansson,', 'Olsson,', 'McKane,', 'Pain,', 'Trout,', 'Niskanen,', 'Adams,', 'Jussila,', 'Hakkarainen,', 'Oreskovic,', 'Gale,', 'Widegren,', 'Richards,', 'Birkeland,', 'Lefebre,', 'Sdycoff,', 'Hart,', 'Minahan,', 'Cunningham,', 'Sundman,', 'Meek,', 'Drew,', 'Silven,', 'Matthews,', 'Van', 'Gheorgheff,', 'Charters,', 'Zimmerman,', 'Danbom,', 'Rosblom,', 'Wiseman,', 'Clarke,', 'Phillips,', 'Flynn,', 'Pickard,', 'Bjornstrom-Steffansson,', 'Thorneycroft,', 'Louch,', 'Kallio,', 'Silvey,', 'Carter,', 'Ford,', 'Richards,', 'Fortune,', 'Kvillner,', 'Hart,', 'Hampe,', 'Petterson,', 'Reynaldo,', 'Johannesen-Bratthammer,', 'Dodge,', 'Mellinger,', 'Seward,', 'Baclini,', 'Peuchen,', 'West,', 'Hagland,', 'Foreman,', 'Goldenberg,', 'Peduzzi,', 'Jalsevac,', 'Millet,', 'Kenyon,', 'Toomey,', "O'Connor,", 'Anderson,', 'Morley,', 'Gee,', 'Milling,', 'Maisner,', 'Goncalves,', 'Campbell,', 'Smart,', 'Scanlan,', 'Baclini,', 'Keefe,', 'Cacic,', 'West,', 'Jerwan,', 'Strandberg,', 'Clifford,', 'Renouf,', 'Braund,', 'Karlsson,', 'Hirvonen,', 'Goodwin,', 'Frost,', 'Rouse,', 'Turkula,', 'Bishop,', 'Lefebre,', 'Hoyt,', 'Kent,', 'Somerton,', 'Coutts,', 'Hagland,', 'Windelov,', 'Molson,', 'Artagaveytia,', 'Stanley,', 'Yousseff,', 'Eustis,', 'Shellard,', 'Allison,', 'Svensson,', 'Calic,', 'Canavan,', "O'Sullivan,", 'Laitinen,', 'Maioni,', 'Penasco', 'Quick,', 'Bradley,', 'Olsen,', 'Lang,', 'Daly,', 'Webber,', 'McGough,', 'Rothschild,', 'Coleff,', 'Walker,', 'Lemore,', 'Ryan,', 'Angle,', 'Pavlovic,', 'Perreault,', 'Vovk,', 'Lahoud,', 'Hippach,', 'Kassem,', 'Farrell,', 'Ridsdale,', 'Farthing,', 'Salonen,', 'Hocking,', 'Quick,', 'Toufik,', 'Elias,', 'Peter,', 'Cacic,', 'Hart,', 'Butt,', 'LeRoy,', 'Risien,', 'Frolicher,', 'Crosby,', 'Andersson,', 'Andersson,', 'Beane,', 'Douglas,', 'Nicholson,', 'Beane,', 'Padro', 'Goldsmith,', 'Davies,', 'Thayer,', 'Sharp,', "O'Brien,", 'Leeni,', 'Ohman,', 'Wright,', 'Duff', 'Robbins,', 'Taussig,', 'de', 'Morrow,', 'Sivic,', 'Norman,', 'Simmons,', 'Meanwell,', 'Davies,', 'Stoytcheff,', 'Palsson,', 'Doharr,', 'Jonsson,', 'Harris,', 'Appleton,', 'Flynn,', 'Kelly,', 'Rush,', 'Patchett,', 'Garside,', 'Silvey,', 'Caram,', 'Jussila,', 'Christy,', 'Thayer,', 'Downton,', 'Ross,', 'Paulner,', 'Taussig,', 'Jarvis,', 'Frolicher-Stehli,', 'Gilinski,', 'Murdlin,', 'Rintamaki,', 'Stephenson,', 'Elsbury,', 'Bourke,', 'Chapman,', 'Van', 'Leitch,', 'Johnson,', 'Boulos,', 'Duff', 'Jacobsohn,', 'Slabenoff,', 'Harrington,', 'Torber,', 'Homer,', 'Lindell,', 'Karaic,', 'Daniel,', 'Laroche,', 'Shutes,', 'Andersson,', 'Jardin,', 'Murphy,', 'Horgan,', 'Brocklebank,', 'Herman,', 'Danbom,', 'Lobb,', 'Becker,', 'Gavey,', 'Yasbeck,', 'Kimball,', 'Nakid,', 'Hansen,', 'Bowen,', 'Sutton,', 'Kirkland,', 'Longley,', 'Bostandyeff,', "O'Connell,", 'Barkworth,', 'Lundahl,', 'Stahelin-Maeglin,', 'Parr,', 'Skoog,', 'Davis,', 'Leinonen,', 'Collyer,', 'Panula,', 'Thorneycroft,', 'Jensen,', 'Sagesser,', 'Skoog,', 'Foo,', 'Baclini,', 'Harper,', 'Cor,', 'Simonius-Blumer,', 'Willey,', 'Stanley,', 'Mitkoff,', 'Doling,', 'Kalvik,', "O'Leary,", 'Hegarty,', 'Hickman,', 'Radeff,', 'Bourke,', 'Eitemiller,', 'Newell,', 'Frauenthal,', 'Badt,', 'Colley,', 'Coleff,', 'Lindqvist,', 'Hickman,', 'Butler,', 'Rommetvedt,', 'Cook,', 'Taylor,', 'Brown,', 'Davidson,', 'Mitchell,', 'Wilhelms,', 'Watson,', 'Edvardsson,', 'Sawyer,', 'Turja,', 'Goodwin,', 'Cardeza,', 'Peters,', 'Hassab,', 'Olsvigen,', 'Goodwin,', 'Brown,', 'Laroche,', 'Panula,', 'Dakic,', 'Fischer,', 'Madill,', 'Dick,', 'Karun,', 'Lam,', 'Saad,', 'Weir,', 'Chapman,', 'Kelly,', 'Mullens,', 'Thayer,', 'Humblen,', 'Astor,', 'Silverthorne,', 'Barbara,', 'Gallagher,', 'Hansen,', 'Morley,', 'Kelly,', 'Calderhead,', 'Cleaver,', 'Moubarek,', 'Mayne,', 'Klaber,', 'Taylor,', 'Larsson,', 'Greenberg,', 'Soholt,', 'Endres,', 'Troutt,', 'McEvoy,', 'Johnson,', 'Harper,', 'Jensen,', 'Gillespie,', 'Hodges,', 'Chambers,', 'Oreskovic,', 'Renouf,', 'Mannion,', 'Bryhl,', 'Ilmakangas,', 'Allen,', 'Hassan,', 'Knight,', 'Berriman,', 'Troupiansky,', 'Williams,', 'Ford,', 'Lesurer,', 'Ivanoff,', 'Nankoff,', 'Hawksford,', 'Cavendish,', 'Ryerson,', 'McNamee,', 'Stranden,', 'Crosby,', 'Abbott,', 'Sinkkonen,', 'Marvin,', 'Connaghton,', 'Wells,', 'Moor,', 'Vande', 'Jonkoff,', 'Herman,', 'Hamalainen,', 'Carlsson,', 'Bailey,', 'Theobald,', 'Rothes,', 'Garfirth,', 'Nirva,', 'Barah,', 'Carter,', 'Eklund,', 'Hogeboom,', 'Brewe,', 'Mangan,', 'Moran,', 'Gronnestad,', 'Lievens,', 'Jensen,', 'Mack,', 'Elias,', 'Hocking,', 'Myhrman,', 'Tobin,', 'Emanuel,', 'Kilgannon,', 'Robert,', 'Ayoub,', 'Dick,', 'Long,', 'Johnston,', 'Ali,', 'Harmer,', 'Sjoblom,', 'Rice,', 'Dean,', 'Guggenheim,', 'Keane,', 'Gaskell,', 'Sage,', 'Hoyt,', 'Dantcheff,', 'Otter,', 'Leader,', 'Osman,', 'Ibrahim', 'Van', 'Ponesell,', 'Collyer,', 'Carter,', 'Thomas,', 'Hedman,', 'Johansson,', 'Andrews,', 'Pettersson,', 'Meyer,', 'Chambers,', 'Alexander,', 'Lester,', 'Slemen,', 'Andersson,', 'Tomlin,', 'Fry,', 'Heininen,', 'Mallet,', 'Holm,', 'Skoog,', 'Hays,', 'Lulic,', 'Reuchlin,', 'Moor,', 'Panula,', 'Flynn,', 'Lam,', 'Mallet,', 'McCormack,', 'Stone,', 'Yasbeck,', 'Richards,', 'Saad,', 'Augustsson,', 'Allum,', 'Compton,', 'Pasic,', 'Sirota,', 'Chip,', 'Marechal,', 'Alhomaki,', 'Mudd,', 'Serepeca,', 'Lemberopolous,', 'Culumovic,', 'Abbing,', 'Sage,', 'Markoff,', 'Harper,', 'Goldenberg,', 'Andersson,', 'Svensson,', 'Boulos,', 'Lines,', 'Carter,', 'Aks,', 'Wick,', 'Daly,', 'Baclini,', 'Razi,', 'Hansen,', 'Giles,', 'Swift,', 'Sage,', 'Gill,', 'Bystrom,', 'Duran', 'Roebling,', 'van', 'Johnson,', 'Balkic,', 'Beckwith,', 'Carlsson,', 'Vander', 'Abelson,', 'Najib,', 'Gustafsson,', 'Petroff,', 'Laleff,', 'Potter,', 'Shelley,', 'Markun,', 'Dahlberg,', 'Banfield,', 'Sutehall,', 'Rice,', 'Montvila,', 'Graham,', 'Johnston,', 'Behr,', 'Dooley,']

In [21]:
df.head(n=2)

   PassengerId  Survived  Pclass  ... Parch     Fare  Embarked
0            1         0       3  ...     0   7.2500         S
1            2         1       1  ...     0  71.2833         C

[2 rows x 10 columns]

In [22]:
df3 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
                    'value': [1, 2, 3, 5]})

In [23]:
df4 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
                    'value': [5, 6, 7, 8]})

In [24]:
df3

  lkey  value
0  foo      1
1  bar      2
2  baz      3
3  foo      5

In [25]:
df4

  rkey  value
0  foo      5
1  bar      6
2  baz      7
3  foo      8

In [26]:
df3.merge(df4, left_on='lkey', right_on='rkey')

  lkey  value_x rkey  value_y
0  foo        1  foo        5
1  foo        1  foo        8
2  foo        5  foo        5
3  foo        5  foo        8
4  bar        2  bar        6
5  baz        3  baz        7

In [27]:
def name_extract(word):
    return word.split(",")[1].split(".")[0].strip()

In [28]:
name_extract("Kelly, Mr. James")

'Mr'

In [29]:
df5=pd.DataFrame({"Salutation":df["Name"].apply(name_extract)})

In [30]:
df5.head()

  Salutation
0         Mr
1        Mrs
2       Miss
3        Mrs
4         Mr

In [31]:
df=pd.merge(df,df5,left_index=True,right_index=True)

In [32]:
df.head()

   PassengerId  Survived  Pclass  ...     Fare Embarked  Salutation
0            1         0       3  ...   7.2500        S          Mr
1            2         1       1  ...  71.2833        C         Mrs
2            3         1       3  ...   7.9250        S        Miss
3            4         1       1  ...  53.1000        S         Mrs
4            5         0       3  ...   8.0500        S          Mr

[5 rows x 11 columns]

In [33]:
df.Salutation.unique()

array(['Mr', 'Mrs', 'Miss', 'Master', 'Don', 'Rev', 'Dr', 'Mme', 'Ms',
       'Major', 'Lady', 'Sir', 'Mlle', 'Col', 'Capt', 'the Countess',
       'Jonkheer'], dtype=object)